5t31thphoto/fox_s3/firmware/sdkconfig.defaults
# ---- Target / flash ----
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- PSRAM (AtomS3R has 8MB octal PSRAM) ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ---- CPU / power ----
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# ---- Arduino ----
CONFIG_AUTOSTART_ARDUINO=y
CONFIG_ARDUINO_LOOP_STACK_SIZE=16384

# ---- esp-sr: MultiNet7 English, no wake word (PTT only) ----
CONFIG_SR_MN_ENGLISH=y
CONFIG_SR_MN_EN_MULTINET7_QUANT=y
CONFIG_MODEL_IN_SPIFFS=y
# We deliberately do NOT enable any WakeNet model: interaction is push-to-talk.
CONFIG_SR_WN_NONE=y

# ---- USB CDC for the web flasher's post-flash config handshake ----
CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_TINYUSB_CDC_ENABLED=y

# ---- misc ----
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
